{
  "backend/main.mo": "Main Motoko actor implementing the Wingo game backend with user profile management, round tracking, and bet placement, protected by an access control/authorization mixin that restricts operations by role.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features (Wingo game frontend UI and casino neon visual theme) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, serving as a reference for the purpose and key details of every component, hook, and style file.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom property tokens for light and dark themes including colors, borders, and chart palette.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, mounting the root div and loading the main TSX entry point.",
  "frontend/src/App.tsx": "Root React component that manages authentication state, shows a landing screen for guests or the WingoLobby for authenticated users, and conditionally renders the ProfileSetupModal for new users.",
  "frontend/src/components/Header.tsx": "App header component displaying the Wingo logo, authenticated user's profile name, and the LoginButton with dark glass-morphism styling.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity that clears the React Query cache on logout and handles already-authenticated edge cases, styled with neon green/red variants.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter a player name before accessing the game, with validation and a save profile mutation.",
  "frontend/src/components/WingoGame/BetHistoryTable.tsx": "Displays a scrollable table of the authenticated user's past bets, showing selection, amount, and win/loss result with payout calculations.",
  "frontend/src/components/WingoGame/BettingPanel.tsx": "Renders the betting UI allowing authenticated users to select a number or color and place a bet on the current open round, with quick-amount buttons and feedback messages.",
  "frontend/src/components/WingoGame/CountdownTimer.tsx": "Shows a live countdown timer for the current Wingo round, updating every second and applying urgent styling when 10 or fewer seconds remain.",
  "frontend/src/components/WingoGame/ResultModal.tsx": "A dialog that displays the winning number and color for a completed round along with the player's bet outcomes and net profit/loss.",
  "frontend/src/components/WingoGame/RoundHistory.tsx": "Fetches and displays the last 10 resolved Wingo rounds as a row of color-coded badges, with loading skeletons and an empty state.",
  "frontend/src/components/WingoGame/RoundResultsBadge.tsx": "A small visual badge component that renders a single round's winning number and color (red, green, or violet) with matching neon styling.",
  "frontend/src/components/WingoGame/WingoLobby.tsx": "Main lobby component for the Wingo game that displays a countdown timer, round history, betting panel, bet history table, and a result modal triggered when the round ID changes.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating game data (current round, round history, bet history, user profile, and placing bets) against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Rajdhani and Orbitron fonts, sets up Tailwind layers, defines CSS custom properties for a dark neon theme, and adds utility classes for neon glows and animated effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback for sensitive values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Wingo game frontend, extending the theme with neon/game color palettes, custom fonts (Orbitron, Rajdhani), neon box shadows, and animation keyframes, while enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state for the Wingo game, including existing frontend features (lobby UI, neon theme), pending new feature requests (backend game logic, new platform), and architectural/image asset requirements."
}